In [1]:
# Instala la librería matplotlib si no está instalada
!pip3 install matplotlib

Requirement already satisfied: matplotlib in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (3.10.3)
Requirement already satisfied: contourpy>=1.0.1 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from matplotlib) (1.3.2)
Requirement already satisfied: cycler>=0.10 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from matplotlib) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from matplotlib) (4.58.0)
Requirement already satisfied: kiwisolver>=1.3.1 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from matplotlib) (1.4.8)
Requirement already satisfied: numpy>=1.23 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from matplotlib) (2.2.6)
Requirement already satisfied: packaging>=20.0 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from matplotlib) (25.0)
Requirement already satisfied: pillow>=8 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from matplotlib) (11.2.1)
Requirement already satisfied: pyparsing>=2.3.1 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from matplotlib) (3.2.3)
Requirement already satisfied: python-dateutil>=2.7 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from matplotlib) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from python-dateutil>=2.7->matplotlib) (1.17.0)

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: pip3 install --upgrade pip

In [3]:
# Importación de librerías necesarias para el análisis de datos y visualización\import pandas as pd
import sys  # No se usa explícitamente
import datetime as dt  # No se usa explícitamente
import numpy as np  # No se usa explícitamente
import matplotlib.pyplot as plt
import matplotlib
import pandas as pd

# Habilita que las gráficas se vean dentro del notebook
%matplotlib inline

In [4]:
# Crear un DataFrame simple con columnas 'a' y 'b'
mi_df = pd.DataFrame({'a': [11, 12, 13], 'b': [21, 22, 23]})
print(mi_df)

    a   b
0  11  21
1  12  22
2  13  23

In [5]:
# Crear un DataFrame desde un diccionario
# Contiene información de ciudades, capitales y zonas
data = {'ciudad': ['Loja', 'Pichincha', 'Guayas'],
        'capital' : ['Loja', 'Quito', 'Guayaquil'],
        'zona'  : [7, 8, 1]}
frame = pd.DataFrame(data)
frame

      ciudad    capital  zona
0       Loja       Loja     7
1  Pichincha      Quito     8
2     Guayas  Guayaquil     1

In [6]:
# Definir una lista con nombres de columnas para futuros DataFrames
columnas = ['nombres','apellidos','cedula']

In [7]:
# Lista de datos con nombres, apellidos y cédulas
lista = [['rene', 'elizalde', '11041260'],
        ['rolando', 'solano', '11041261'],]

In [8]:
# Crear un DataFrame con los datos de la lista y las columnas definidas
data = pd.DataFrame(lista, columns=columnas)

In [9]:
# Mostrar el DataFrame creado
data

   nombres apellidos    cedula
0     rene  elizalde  11041260
1  rolando    solano  11041261

In [10]:
# Crear otra lista con más datos similares
lista2 = [['rene2', 'elizalde2', '11041263'],
        ['rolando2', 'solano2', '11041264'],]

In [11]:
# Crear otro DataFrame con la segunda lista
data2 = pd.DataFrame(lista2, columns=columnas)

In [12]:
# Mostrar el segundo DataFrame
data2

    nombres  apellidos    cedula
0     rene2  elizalde2  11041263
1  rolando2    solano2  11041264

In [13]:
# Unir ambos DataFrames (uno debajo del otro)
data3 = pd.concat([data, data2])

In [14]:
# Mostrar el DataFrame combinado
data3

    nombres  apellidos    cedula
0      rene   elizalde  11041260
1   rolando     solano  11041261
0     rene2  elizalde2  11041263
1  rolando2    solano2  11041264

In [15]:
# Crear un DataFrame adicional con datos geográficos asociados a las cédulas
data5 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263', '11041266'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito', 'Loja'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha', 'Loja']})

In [16]:
# Mostrar el DataFrame con ubicación
data5

     cedula     Ciudad  Provincia
0  11041260  Guayaquil     Guayas
1  11041261     Cuenca      Azuay
2  11041263      Quito  Pichincha
3  11041266       Loja       Loja

In [17]:
# Fusionar los DataFrames por la columna 'cedula'
result = pd.merge(data3, data5, on='cedula')

In [18]:
# Mostrar el resultado de la fusión
result

   nombres  apellidos    cedula     Ciudad  Provincia
0     rene   elizalde  11041260  Guayaquil     Guayas
1  rolando     solano  11041261     Cuenca      Azuay
2    rene2  elizalde2  11041263      Quito  Pichincha

In [19]:
# Crear un nuevo DataFrame geográfico (más reducido que data5)
data6 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha']})
data6

     cedula     Ciudad  Provincia
0  11041260  Guayaquil     Guayas
1  11041261     Cuenca      Azuay
2  11041263      Quito  Pichincha